Tekla Open API Reference for Tekla Structures 2025
PluginBase.IsDefaultValue Method (Double)
 Returns true if the given value is set to the default value for this type.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsDefaultValue(
	double Value
)
Public Function IsDefaultValue (
	Value As Double
) As Boolean
Parameters
Value
Type: System.Double
The value to test.
Return Value
Type: Boolean
True if the value is set to the default.
See Also
Reference
PluginBase Class
IsDefaultValue Overload
Tekla.Structures.Plugins Namespace